#+title: Mongoose

This library contains Common Lisp bindings to the [[https://mongoose.ws][Mongoose]] web server library
written in C. Internally Mongoose is event based and so can handle decent
concurrent load, but it is otherwise single-threaded in nature.

This library has no Common Lisp dependencies, and by default Mongoose itself
only requires =openssl=.

*** Headers

It is a general requirement of HTTP that headers be postfixed by =\r\n=. For
single headers you can do this yourself like so:

#+begin_src lisp
(defparameter *content-type-text* (format nil "Content-Type: text/plain~c~c" #\return #\linefeed))
#+end_src

And for multiple via the =headers= helper:

#+begin_src lisp :exports both
(in-package :mongoose)
(headers '("Content-Type: text/plain" "User-Agent: foo"))
#+end_src

#+RESULTS:
: Content-Type: text/plain
: User-Agent: foo

Either way, you're encouraged to preallocate common headers via a =defparameter=
as shown above.

If no headers are necessary, Mongoose also accepts =nil= (NULL in C).

#+begin_src lisp
(http-reply c 404 nil "")
#+end_src

